CI4 - Mission3/app/Models/mahasiswamodel.php

SELECT *
FROM `mahasiswa`
---
    public function getmahasiswa()
    {
        // Kode ini sudah benar untuk mengambil data dari database
        return $this->findAll();

SELECT *
FROM `mahasiswa`
WHERE `nim` = '072'
 LIMIT 1
---
    public function getMahasiswaByNim($nim)
    {
        // Cari data berdasarkan kolom 'nim' dan ambil baris pertama
        return $this->where(['nim' => $nim])->first();