CI4 - Mission3/app/Controllers/Admin.php

    public function courses()
    {
        $model = new CourseModel();
        $data['courses'] = $model->findAll();
---
SELECT *
FROM `courses`

    public function students()
    {
        $model = new MahasiswaModel();
        $data['students'] = $model->findAll();
---
SELECT *
FROM `mahasiswa`

    public function storeStudent()
    {
        $model = new MahasiswaModel();
        $model->save([
            'NIM' => $this->request->getPost('NIM'),
            'nama' => $this->request->getPost('nama'),
            'umur' => $this->request->getPost('umur'),
        ]);
---
INSERT INTO `mahasiswa` (`NIM`, `nama`, `umur`, `created_at`, `updated_at`) VALUES ('009', 'ibung', '14', '2025-09-17 06:50:03', '2025-09-17 06:50:03')

    public function updateStudent($id)
    {
        $model = new MahasiswaModel();
        $model->update($id, [
            'NIM' => $this->request->getPost('NIM'),
            'nama' => $this->request->getPost('nama'),
            'umur' => $this->request->getPost('umur'),
        ]);
        return redirect()->to('/admin/students')->with('success', 'Mahasiswa berhasil diperbarui');
---
SELECT *
FROM `mahasiswa`