CI4 - Mission3/app/Controllers/Student.php

SELECT *
FROM `courses`
SELECT `c`.`id`, `c`.`title`, `c`.`description`
FROM `enrollments` `e`
JOIN `courses` `c` ON `c`.`id` = `e`.`course_id`
WHERE `e`.`user_id` = '2'
---
    public function courses()
    {
        $courseModel = new CourseModel();
        $enrollmentModel = new EnrollmentModel();
        $db = Database::connect();

        $userId = session()->get('user_id'); // Gunakan user_id

        // Semua courses
        $allCourses = $courseModel->findAll();

        // Course yang sudah diambil mahasiswa ini
        $takenCourses = $db->table('enrollments e')
            ->select('c.id, c.title, c.description')
            ->join('courses c', 'c.id = e.course_id')
            ->where('e.user_id', $userId) // Ubah ke user_id
            ->get()->getResultArray();

SELECT *
FROM `enrollments`
WHERE `user_id` = '2'
AND `course_id` = '1'
 LIMIT 1
INSERT INTO `enrollments` (`user_id`, `course_id`, `enrolled_at`) VALUES ('2', '1', '2025-09-21 14:45:28')
---
    public function enroll($courseId)
    {
        $userId = session()->get('user_id'); // Ubah ke user_id
        $enrollmentModel = new EnrollmentModel();

        // Cek apakah sudah pernah enroll course ini
        $exists = $enrollmentModel
            ->where('user_id', $userId) // Ubah ke user_id
            ->where('course_id', $courseId)
            ->first();

        if ($exists) {
            return redirect()->to('/student/courses')->with('error', 'Anda sudah enroll course ini.');
        }

        // Simpan enroll baru
        $enrollmentModel->save([
            'user_id' => $userId, // Ubah ke user_id
            'course_id' => $courseId,
            'enrolled_at' => date('Y-m-d H:i:s')
        ]);